---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId.Dispose
source: html/a1cae5f2-1dc0-e833-f7bb-5a4b8acfa8d2.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId.Dispose Method

Releases all resources used by the MEPNetworkSegmentId

## Syntax (C#)
```csharp
public void Dispose()
```